#Задание 1
num = 1
while num != 0:
    num = float(input("Введите число или ноль для завершения программы: "))
    if (num == 0):
        break
    print("Число, обратное введеному числу: ",1/num)

#Задание 2
#Вариант 1
x = 10
day = 1
while day <= 7:
    x = x + x*0.1
    day += 1
print("Суммарный путь пробежал спортсмен за 1 неделю -",x)

#Вариант 3
a = 3
count = 1
while a <= 24:
    count *= 2
    print("За ",a,"часов получилось",count,"амеб")
    a += 3

#Вариант 5
a = 0
s = 0
p = 1
while a < 25:
    x = int(input("x = "))
    s += x
    p *= x
    a += 1
print("Сумма произвольных чисел - ",s,'\n'"Произведение произвольных чисел - ",p)